Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: དེ་ཆོས་གང་ཡང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་འགལ་བར་མི་མཐོང་གི །
en: There are absolutely no phenomena to be found that contradict awakening to buddhahood.

source: དེ་ཆོས་ཐམས་ཅད་སྒྲིབ་པ་མ་མཆིས་པར་མཐོང་།
en: In fact, they find nothing that obscures any phenomena.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་སྐལ་བ་མཉམ་པ་དང་མ་འགགས་པར་མཐོང་ངོ་། །
en: They find no obstruction to that which is related to the awakening of buddhahood.

source: དེ་གང་ལས་ལྡོག་པ་དང་། གང་དུ་འཇུག་པའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: They correctly do not see any phenomena to reject or accept.

source: དེ་སེམས་ཅན་དེ་དག་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ། སེམས་ཅན་གྱི་དོན་བགྱི་བ་ལ་མི་ཕྱོགས་པ་ཡང་མ་ལགས་སོ། །
en: They also correctly do not see beings but are not disinclined to act for their benefit.

source: བཅོམ་ལྡན་འདས་བཟོད་པ་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྤོབས་པ་ཟབ་མོ་འཐོབ་སྟེ།
en: “Blessed One, bodhisattva great beings who have such patience attain profound confident eloquence.

source: སྤོབས་པ་ཟབ་མོ་དེ་གང་ཞེ་ན།
en: What is profound confident eloquence?

source: གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་མི་རྟོགས་པའོ། །
en: It is something that śrāvakas and pratyekabuddhas do not realize.

source: ཕན་པའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: Bodhisattvas also attain beneficent confident eloquence.

source: ཕན་པའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is beneficent confident eloquence?

source: གང་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་ཉིད་དུ་འགྱུར་གྱི། མི་ཕན་པར་མི་འགྱུར་བའོ། །
en: It is that by which they become able to benefit all beings and which does not cease to be beneficial.

source: རན་པའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain an appropriate confident eloquence.

source: རན་པའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is appropriate confident eloquence?

source: གང་ཇི་ཙམ་གྱི་གཏམ་གྱིས་སེམས་ཅན་བདེ་བར་འགྱུར་བ་དེ་ཙམ་གྱི་གཏམ་བགྱིས་པ་འདི་ནི་རན་པའི་སྤོབས་པ་ཞེས་བགྱིའོ། །
en: Making exactly the right kinds of statements that will make beings happy is what is called ‘appropriate confident eloquence.’

source: མྱུར་བའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain swift confident eloquence.

source: མྱུར་བའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is swift confident eloquence?

source: གང་གིས་མྱུར་དུ་སེམས་ཅན་རྣམས་འདུལ་བའོ། །
en: It is that by which they swiftly tame beings.

source: འབྲས་བུ་མཆིས་པའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain effective confident eloquence.

source: འབྲས་བུ་མཆིས་པའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is effective confident eloquence?

source: གང་གིས་རྒྱུན་མི་འཆད་པར་སེམས་ཅན་ཐར་བར་བགྱིད་པའོ། །
en: It is that which uninterruptedly liberates beings.

source: ལྷན་ཅིག་པའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain shared confident eloquence.

source: ལྷན་ཅིག་པའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is shared confident eloquence?

source: གང་གིས་སངས་རྒྱས་རྣམས་དང་ལྷན་ཅིག་སྨྲ་བའོ། །
en: It that by which they speak in unison with the buddhas.

source: སྐྱེ་བའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain productive confident eloquence.

source: སྐྱེ་བའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is productive confident eloquence?

source: གང་གིས་ཚིག་གཅིག་བསྟན་པས་ཚིག་བརྒྱ་སྟོང་ལས་ལྷག་པའི་སྤོབས་པ་སྐྱེ་བའོ། །
en: It is the arising of an eloquence that allows them to speak over a hundred thousand words when uttering just one.

source: ཡང་བའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain concise confident eloquence.

source: ཡང་བའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is concise confident eloquence?

source: གང་གིས་བརྡ་བགྱིས་པ་ཙམ་གྱིས་ཐམས་ཅད་ཤེས་ནས་སྟོན་པའོ། །
en: It is that through which they know and teach everything with only symbols.

source: བདེ་བའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain an easy confident eloquence.

source: བདེ་བའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is easy confident eloquence?

source: བདེ་བའི་སྤོབས་པ་གང་གིས་འདུལ་བ་རྣམས་ཉན་པས་ངོམས་པར་མི་འགྱུར་བའོ། །
en: It is that which disciples never get tired of hearing.

source: ཅང་ཤེས་ཀྱི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain a clever confident eloquence.

source: ཅང་ཤེས་ཀྱི་སྤོབས་པ་གང་ཞེ་ན།
en: What is clever confident eloquence?

source: གང་གིས་སངས་རྒྱས་ཀྱི་དགོངས་པ་ལས་མི་འདའ་བའོ། །
en: It is that which does not transgress the intentions of the buddhas.

source: དུལ་བའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain the confident eloquence of discipline.

source: དུལ་བའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is the confident eloquence of discipline?

source: གང་གིས་རྒྱགས་པ་དང་། བག་མེད་པ་མི་སྐྱེད་པའོ། །
en: It is that which does not produce arrogance or carelessness.

source: ཞི་བའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain the confident eloquence of peace.

source: ཞི་བའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is the confident eloquence of peace?

source: གང་གིས་བདག་དང་གཞན་རྣམས་ཞི་བར་བགྱིད་པའོ། །
en: It is that which pacifies self and other.

source: སྒྲའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain the confident eloquence of words.

source: སྒྲའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is the confident eloquence of words?

source: གང་གིས་སེམས་ཅན་རྣམས་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་འདུལ་བའོ། །
en: It is that which tames beings according to the Śrāvaka Vehicle.

source: དབེན་པའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain the confident eloquence of isolation.

source: དབེན་པའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is the confident eloquence of isolation?

source: གང་གིས་སེམས་ཅན་རྣམས་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་འདུལ་བའོ། །
en: It is that which tames beings according to the Pratyekabuddha Vehicle.

source: མཐོ་བའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain exalted confident eloquence.

source: མཐོ་བའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is exalted confident eloquence?

source: གང་གིས་སེམས་ཅན་རྣམས་ཐེག་པ་ཆེན་པོ་ལ་འདུལ་བའོ། །
en: It is that which tames beings according to the Great Vehicle.

source: ཐུན་མོང་མ་ལགས་པའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain uncommon confident eloquence.

source: ཐུན་མོང་མ་ལགས་པའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is uncommon confident eloquence?

source: གང་གིས་མ་འདྲེས་པ་དང་། སྟོབས་དང་། མི་འཇིགས་པའི་གཏམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པའོ། །
en: It is that which articulates statements that are unadulterated, powerful, and fearless.

source: ཞི་གནས་ཀྱི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain the confident eloquence of meditative calm.

source: ཞི་གནས་ཀྱི་སྤོབས་པ་གང་ཞེ་ན།
en: What is the confident eloquence of meditative calm?

source: གང་གིས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་གཏམ་རྣམས་བགྱིད་པའོ། །
en: It is that which makes statements about the factors of awakening.

source: མ་སྨད་པའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain the confident eloquence that does not chastise.

source: མ་སྨད་པའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is the confident eloquence that does not chastise?

source: གང་གིས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བགྱིད་པའོ། །
en: It is that which satisfies beings.

source: རྒྱུ་དང་རྐྱེན་གྱི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain the confident eloquence of causes and conditions.

source: རྒྱུ་དང་རྐྱེན་གྱི་སྤོབས་པ་གང་ཞེ་ན།
en: What is the confident eloquence of causes and conditions?

source: གང་གིས་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཚར་གཅོད་པའོ། །
en: It is that which defeats all opponents.

source: སྟོན་པའི་སྤོབས་པ་ཡང་འཐོབ་སྟེ།
en: They also attain the confident eloquence of teaching.

source: སྟོན་པའི་སྤོབས་པ་གང་ཞེ་ན།
en: What is the confident eloquence of teaching?

source: གང་གིས་འཁོར་བཞི་ལ་བག་མི་ཚ་བར་ཆོས་སྟོན་པའོ། །
en: It is that by which they teach Dharma to the four assemblies without anxiety.

source: བཅོམ་ལྡན་འདས་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་པ་སྙམ་བགྱི་ན།
en: “Blessed One, I wonder if what I said here is a discourse on the Dharma?

source: བཅོམ་ལྡན་འདས་བདག་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་པར་བགྱིད་དམ།
en: Blessed One, do you consider my discourse on the Dharma to be in accord with those already given?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མ་འགགས་པ་ཁྱོད་ཀྱི་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་ནོ།། །།བམ་པོ་དྲུག་པ།
en: The Blessed One replied, “Aniruddha, your Dharma discourse is in accord.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཡང་དག་པར་བརྗོད་པ་ཚོལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འཛིན་པ་བཙལ་བར་བགྱིའོ། །
en: The venerable Rāhula next addressed the Blessed One: “Blessed One, a bodhisattva who seeks a Dharma discourse should look for someone who upholds the Dharma.

source: བཅོམ་ལྡན་འདས་ཆོས་འཛིན་པ་རྣམས་ལས་ཆོས་རྟོགས་པར་འགྱུར་རོ། །
en: Blessed One, realization of the Dharma comes from those who uphold the Dharma.

source: དེ་བས་ན་ཆོས་བཙལ་བ་དེ་ལ་བརྩོན་པར་གྱུར་པས་ཆོས་འཛིན་པ་རྣམས་ལས་བཙལ་བར་བགྱིའོ། །
en: Thus, those who strive in their search for the Dharma search for those who uphold the Dharma.

source: བཅོམ་ལྡན་འདས་ཆོས་ལྷུར་ལེན་པ་རྣམས་ལས་ཆོས་སྐྱེའི་ཟང་ཟིང་ལྷུར་ལེན་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: Blessed One, the Dharma comes from those who prioritize the Dharma, not those who prioritize material goods.

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་རྣམས་དང་། འཇིག་རྟེན་ཕ་རོལ་ལ་ལྟ་བ་དང་བཅས་པ་རྣམས་དང་། དབེན་པ་འདོད་པ་རྣམས་ལས་སྐྱེའི།
en: It comes from those who take no interest in their body and health, who look beyond the world, and who long for solitude.

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་ལ་མངོན་པར་དད་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It does not come from those who are fascinated by towns, cities, and markets.

source: འགྲོགས་ན་བདེ་བ་རྣམས་ལས་སྐྱེའི། འགྲོགས་ན་མི་བདེ་བ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who are easy to get along with, not from those who are not.

source: ང་རྒྱལ་མ་མཆིས་པ་རྣམས་ལས་སྐྱེའི། ང་རྒྱལ་གྱིས་ཁེངས་པ་རྣམས་ལས་མ་ལགས་སོ། །དེས་པ་རྣམས་ལས་སྐྱེའི།
en: It comes from those who are not prideful, not from those who are puffed up with pride.

source: མགུ་དཀའ་བ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who are sensitive, not from those who are stubborn.

source: སེམས་མཉེན་ཞིང་འཇམ་པ་རྣམས་ལས་སྐྱེའི། སེམས་ཀྱི་རྒྱུད་རྨན་ཅན་དུ་གྱུར་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who are good-natured and gentle, not from those whose mindstream is damaged.

source: སེམས་དབེན་པ་རྣམས་ལས་སྐྱེའི། སེམས་ཆགས་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those whose minds are withdrawn, not from those whose minds are attached.

source: སྡིག་པ་རྣམ་པར་འབྱེད་པ་རྣམས་ལས་སྐྱེའི། སྡིག་པ་འཆབ་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who expose evil deeds, not from those who conceal them.

source: བཅོམ་ལྡན་འདས་སྦྱིན་པ་ལ་མངོན་པར་དགའ་བ་རྣམས་ལས་ཆོས་སྐྱེའི།
en: “Blessed One, the Dharma comes from those who delight in generosity not from those who are stingy.

source: སེར་སྣ་ཅན་རྣམས་ལས་མ་ལགས་སོ། །ཚུལ་ཁྲིམས་དང་ལྡན་པ་རྣམས་ལས་སྐྱེའི། ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who have discipline, not from those with poor discipline.

source: བཟོད་པ་དང་ལྡན་པ་རྣམས་ལས་སྐྱེའི། གནོད་སེམས་ཅན་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who have patience, not from those who are malicious.

source: བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ལས་སྐྱེའི། ལེ་ལོ་ཅན་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those instilled with diligence, not from those who are lazy.

source: སེམས་རྩེ་གཅིག་པ་རྣམས་ལས་སྐྱེའི། སེམས་རྣམ་པར་གཡེངས་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those with focused minds, not from those who are distracted.

source: ཤེས་རབ་དང་ལྡན་པ་རྣམས་ལས་སྐྱེའི། ཤེས་རབ་འཆལ་པའི་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those with insight, not from those with faulty insight.

source: མང་དུ་ཐོས་པ་རྣམས་ལས་སྐྱེའི། ཐོས་པ་ཉུང་བ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who are learned, not from those who have not studied much.

source: ཚུལ་བཞིན་ཡིད་ལ་བརྩོན་པ་རྣམས་ལས་སྐྱེའི། ངན་པའི་བསམ་པ་སེམས་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who strive to maintain appropriate attentiveness, not from those whose minds are filled with ill intention.

source: ལེགས་པར་བགྱིད་པའི་ལས་བགྱིད་པ་རྣམས་ལས་སྐྱེའི། ངན་པར་བགྱིད་པའི་ལས་བགྱིད་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who engage in positive actions, not from those who engage in negative actions.

source: ལེགས་པར་བཤད་པ་ལ་དགའ་བ་རྣམས་ལས་སྐྱེའི། འཇིག་རྟེན་རྒྱང་པ་ན་པའི་གསང་ཚིག་ལ་མངོན་པར་དགའ་བ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who take joy in elegant statements, not from those who delight in the intrigues of materialist doctrines.

source: སྟོང་པ་ཉིད་ལ་མངོན་པར་དགའ་བ་རྣམས་ལས་སྐྱེའི། ལྟ་བར་གྱུར་པས་རྣམ་པར་བསྒྲིབས་པ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who delight in emptiness, not from those who are obscured by their belief in another view.

source: བསླབ་པ་འཚལ་བ་རྣམས་ལས་སྐྱེའི། བསྟན་བཅོས་འཚལ་བ་རྣམས་ལས་མ་ལགས་སོ། །
en: It comes from those who pursue training, not from those who pursue book learning.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་གང་བསླབ་པ་འཚལ་བ་ནི་དེའི་ཆོས་ལགས་སོ། །
en: “Furthermore, Blessed One, there is the Dharma of those who pursue training.

source: བསླབ་པ་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: What is that training?

source: བཅོམ་ལྡན་འདས་བསླབ་པ་ཐམས་ཅད་ཀྱི་ནང་ན་བསླབ་པ་གསུམ་དུ་བསླབ་པ་ཐམས་ཅད་འདུ་བར་འགྱུར་རོ། །
en: Blessed One, all training can be subsumed within the three trainings.

source: གསུམ་གང་ཞེ་ན།
en: What are those three?

source: ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་དང་། ལྷག་པའི་སེམས་ཀྱི་བསླབ་པ་དང་། ལྷག་པའི་ཤེས་རབ་ཀྱི་བསླབ་པའོ། །
en: Training in higher discipline, higher intention, and higher insight.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བསླབ་པ་གསུམ་པོ་འདི་དག་ལ་སློབ་པ་དེ་ནི་ཐེག་པ་ཆེན་པོ་ཐམས་ཅད་ལ་སློབ་པ་ལགས་སོ། །
en: Blessed One, a bodhisattva great being who trains in these trainings trains in the entire Great Vehicle.

source: བཅོམ་ལྡན་འདས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་གང་ཞེ་ན།
en: “Blessed One, what is a bodhisattva great being’s training in higher discipline?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་པ་ཡང་ལགས་ལ། སོ་སོར་ཐར་པ་ཙམ་གྱིས་དག་པར་ཡང་མི་སེམས་ཏེ།
en: Bodhisattvas are bound by the prātimokṣa vow, but they do not think the prātimokṣa is itself sufficient.

source: བྱང་ཆུབ་སེམས་དཔའི་སྡོམ་པ་ལ་རྟོན་པ་ལགས་སོ། །
en: They adhere to the bodhisattva vow.

source: ཆོ་ག་དང་སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པ་ཡང་ལགས་ལ། ཆོ་ག་དང་སྤྱོད་ཡུལ་ཙམ་གྱིས་དག་པར་ཡང་མི་སེམས་ཏེ།
en: Bodhisattvas perfectly observe the prescriptions and perspectives, but they do not think those prescriptions and perspectives are themselves sufficient.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོ་ག་དང་སྤྱོད་ཡུལ་ལ་རྟོན་པ་ཡང་ལགས་སོ། །
en: They also adhere to the prescriptions and perspectives of a bodhisattva.

source: ཁ་ན་མ་ཐོ་བ་རབ་ཏུ་ཕྲ་བ་དག་ལ་འཇིགས་པར་ལྟ་བ་ཡང་ལགས་ལ། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ལ་རྟོན་པ་ཡང་ལགས་སོ། །
en: They are apprehensive of the most subtle disgraceful act, but also rely on the wisdom of a bodhisattva.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་གང་ཞེ་ན།
en: What is the wisdom of a bodhisattva?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཐམས་ཅད་ཀྱི་དེ་ཁོ་ན་འཚལ་བས་ལས་དང་ཉོན་མོངས་པས་འཇིགས་ཤིང་སྐྲག་པ་མ་མཆིས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་དེ་ཁོ་ན་འཚལ་བ་ལགས་སོ། །
en: Bodhisattvas are not scared or fearful of karma or the afflictive emotions because they understand the basic truth of all phenomena. They understand the basic truth of a bodhisattva.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་གང་ཞེ་ན།
en: What is the perspective of a bodhisattva?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སྟོང་པ་ཉིད་སྤྱོད་ཡུལ་བ་རྣམས་ལགས་ཏེ། རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་སྤྱོད་ཡུལ་བ་མ་ལགས་སོ། །
en: Bodhisattvas take the perspective of emptiness; they do not take a conceptual, contrived, or fabricated perspective.

source: ཡང་དག་པར་བླངས་ནས་བསླབ་པའི་གཞི་རྣམས་ལ་སློབ་སྟེ།
en: They train in the basic precepts upon acceptance.

source: སྟོང་པ་ཉིད་དུ་མཉམ་པ་ཉིད་ཡང་དག་པར་བླངས་ནས་སློབ་པ་འདི་ནི་ཡང་དག་པར་བླངས་ནས་སློབ་པ་ཞེས་བགྱིའོ། །མཚན་མ་མ་མཆིས་པར་མཉམ་པ་ཉིད་དང་།
en: To say they ‘train upon acceptance’ means that they train after accepting the equality of emptiness.

source: སྨོན་པ་མ་མཆིས་པར་མཉམ་པ་ཉིད་དང་། མངོན་པར་འདུ་མི་བགྱིད་པར་མཉམ་པ་ཉིད་དང་། མ་སྐྱེས་པ་དང་། མ་བྱུང་བར་མཉམ་པ་ཉིད་ཡང་དག་པར་བླངས་ནས་སློབ་པ་འདི་ནི་ཡང་དག་པར་བླངས་ནས། བསླབ་པའི་གཞི་རྣམས་ལ་སློབ་པ་ཞེས་བགྱིའོ། །
en: To say they ‘train in the basic precepts upon acceptance’ means that they train after accepting the equality of signlessness, the equality of wishlessness, the equality of the unconditioned, and the equality of that which does not arise or appear.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། སོ་སོར་ཐར་པའི་སྡོམ་པའི་ཚུལ་ཁྲིམས་འདི་ལ་སེམས་ཅན་རྣམས་དགོད་པར་བྱའོ། །
en: Blessed One, a bodhisattva also thinks, ‘I should establish beings in the discipline of the prātimokṣa vows.’

source: སྙམ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་ལགས་སོ། །
en: This is a bodhisattva’s training in higher discipline.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་སེམས་ཀྱི་བསླབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s training in higher intention?

source: གང་རྣམ་པར་ཐར་པ་བརྒྱད་རྣམས་ལ་སློབ་པ་ལགས་སོ། །
en: It is training in the eight liberations.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་ལྷག་པའི་སེམས་ཀྱི་བསླབ་པ་འདི་ལ་སེམས་ཅན་ཐམས་ཅད་བསྒྲུབ་པར་བགྱིའོ་སྙམ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་སེམས་ཀྱི་བསླབ་པ་ལགས་སོ། །
en: A bodhisattva thinks, ‘I will help all beings succeed in the training of higher intention.’

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་ཤེས་རབ་ཀྱི་བསླབ་པ་གང་ཞེ་ན།
en: This is a bodhisattva’s training in higher intention. “What is a bodhisattva’s training in higher insight?

source: གང་སྟོང་པ་ཉིད་རྣམ་པ་བཅྭ་བརྒྱད་ལ་སློབ་པ་ལགས་སོ། །
en: It is the training in the eighteen aspects of emptiness.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། སྟོང་པ་ཉིད་རྣམ་པ་བཅྭ་བརྒྱད་འདི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་ཤེས་རབ་ཀྱི་བསླབ་པ་ལགས་ཏེ།
en: A bodhisattva thinks, ‘I should help all beings understand the eighteen aspects of emptiness.’ This is a bodhisattva’s training in higher insight.

source: བསླབ་པ་གསུམ་པོ་འདི་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཐམས་ཅད་འདུས་ལགས་སོ། །
en: These three trainings constitute the complete training of a bodhisattva.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་སེམས་ཅན་རྣམས་སྲུང་བ་དེ་ནི་ཚུལ་ཁྲིམས་སྲུང་བ་ལགས་སོ། །
en: “Furthermore, Blessed One, a bodhisattva who guards beings guards discipline.

source: གང་ཚུལ་ཁྲིམས་སྲུང་བ་དེ་ནི་ཚུལ་ཁྲིམས་མི་སྙེམས་པ་སྟེ། དེ་ཚུལ་ཁྲིམས་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ནི་མངོན་པར་འབྱུང་བའི་ངང་ཚུལ་ཅན་ཏེ། ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་མི་ཆགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ནི་དབེན་པའི་ངང་ཚུལ་ཅན་ཏེ། འདུ་འཛི་ཐམས་ཅད་ལ་མི་ཆགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ནི་ནང་དུ་ཡང་དག་འཇོག་པའི་ངང་ཚུལ་ཅན་ཏེ། བྱ་བ་ཐམས་ཅད་ལ་མི་ཆགས་སོ། །
en: Bodhisattvas who guard discipline are not conceited about their discipline, and thus use their discipline to fulfill the intentions of all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བསམ་གཏན་གྱི་ངང་ཚུལ་ཅན་ཏེ། ཡུལ་ཐམས་ཅད་ལ་མི་ཆགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ནི་རྣམ་པར་གྲོལ་བའི་ངང་ཚུལ་ཅན་ཏེ། སྐྱེ་བའི་སྐྱེ་མཆེད་ཐམས་ཅད་ལ་མི་ཆགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཉན་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: “Blessed One, bodhisattvas are predisposed to release, and they are not attached to any kind of grasping; bodhisattvas are predisposed to solitude, and they are not attached to any kind of entertainment; bodhisattvas are predisposed to inner composure, and they are not attached to any kind of activity; bodhisattvas are predisposed to meditative concentration, and they are not attached to any sense objects; bodhisattvas are predisposed to liberation, and they are not attached to any states of rebirth; and bodhisattvas are predisposed to listening to the Dharma, and they are not attached to any worldly tales.

source: འཇིག་རྟེན་པའི་གཏམ་ཐམས་ཅད་ལ་མི་ཆགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་སྟོན་པའི་ངང་ཚུལ་ཅན་ཏེ། དཔག་ཚད་བརྒྱར་ཡང་སོང་ནས་ཆོས་སྟོན་པས་ཡོངས་སུ་མི་སྐྱོ་བའོ། །
en: Bodhisattvas are predisposed to teaching the Dharma; they teach the Dharma after traveling a hundred yojanas and do not grow weary.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའི་ངང་ཚུལ་ཅན་ཏེ། སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བའི་ལོག་པར་ལྟ་བ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་མི་སྐྱོ་བའོ། །
en: Bodhisattvas are predisposed to upholding the sublime Dharma; they are not wearied by any suffering or by any mistaken, troubling views.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ངང་ཚུལ་ཅན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་རྩོལ་གྱི། བདག་ལ་ཕན་པའི་ཕྱིར་མ་ལགས་སོ། །
en: Bodhisattvas are predisposed to the mind set on awakening; they work to benefit all beings, not for their own benefit.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བསམ་པའི་ངང་ཚུལ་ཅན་ཏེ། ཐོག་མ་ཁོ་ནར་སེམས་ཅན་རྣམས་བྱང་ཆུབ་པར་འཚལ་གྱི་བདག་ནི་མ་ལགས་སོ། །
en: Bodhisattvas are predisposed to good intentions; they think that they should first seek the awakening of all beings, not their own.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ལྷག་པའི་བསམ་པའི་ངང་ཚུལ་ཅན་ཏེ། གཞན་ཡང་དོན་ཕུན་སུམ་ཚོགས་པས་རབ་ཏུ་ནོར་དང་ལྡན་པ་ལགས་ཀྱི། བདག་གི་ཕུན་སུམ་ཚོགས་པས་ནི་མ་ལགས་སོ། །
en: Bodhisattvas are predisposed to higher intentions; they become rich through the perfection of other beings’ purposes, not through the perfection of their own.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སྦྱོར་བའི་ངང་ཚུལ་ཅན་ཏེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་དགེ་བ་རེ་རེའི་ཕྱིར་ཡང་བསྐལ་པ་གྲངས་མ་མཆིས་པར་ཡོངས་སུ་སྒྲུབ་པར་སྤྲོ་ཞིང་ཡོངས་སུ་མི་སྐྱོ་བའོ། །
en: Bodhisattvas are predisposed to practice; they are not wearied but excited about taking incalculable eons to perfect each and every virtue associated with the factors of awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སྦྱིན་པའི་ངང་ཚུལ་ཅན་ཏེ། ཡན་ལག་གི་དམ་པ་མགོ་ཡང་ཡོངས་སུ་གཏོང་ཞིང་སེམས་ཅན་གྱི་དོན་ཡང་བགྱིད་དོ། །
en: Bodhisattvas are predisposed to generosity; they will even give up their head, the most excellent of limbs, and use it to benefit beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ངང་ཚུལ་ཅན་ཏེ། སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ཡོངས་སུ་མི་གཏོང་ངོ་། །
en: Bodhisattvas are predisposed to discipline; they will not forsake beings with poor discipline.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བཟོད་པའི་ངང་ཚུལ་ཅན་ཏེ། བདུད་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་སོ། །
en: Bodhisattvas are predisposed to patience; they do not fear any māra.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བརྩོན་འགྲུས་ཀྱི་ངང་ཚུལ་ཅན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་བྱང་ཆུབ་ཡང་དག་པར་སྒྲུབ་པས་ཡོངས་སུ་མི་སྐྱོའོ། །
en: Bodhisattvas are predisposed to diligence; they do not grow weary while achieving awakening for all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བསམ་གཏན་གྱི་ངང་ཚུལ་ཅན་ཏེ། སྒྲ་ཐམས་ཅད་དང་བྱ་བའི་བརྩམ་པ་ཐམས་ཅད་ཀྱིས་མི་འཁྲུགས་སོ། །
en: Bodhisattvas are predisposed to meditative concentration; they are not disturbed by any sounds or the need to act.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཤེས་རབ་ཀྱི་ངང་ཚུལ་ཅན་ཏེ། ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་མཚུངས་པར་མཐོང་ངོ་། །
en: Bodhisattvas are predisposed to insight; they see all phenomena as equal to a buddha’s awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སྟོང་པ་ཉིད་ཀྱི་ངང་ཚུལ་ཅན་ཏེ། འཁོར་བ་ལ་མི་གནས་སོ། །
en: Bodhisattvas are predisposed to emptiness; they do not remain in saṃsāra.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སྙིང་རྗེ་ཆེན་པོའི་ངང་ཚུལ་ཅན་ཏེ། ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའོ། །
en: Bodhisattvas are predisposed to great compassion; they do not pass into nirvāṇa.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒྲ་གཅན་ཟིན་ཁྱོད་ཀྱི་འདི་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་ནོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The Blessed One replied, “Rāhula, your Dharma discourse is in accord.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་བདག་དུལ་བ་དེ་སེམས་ཅན་གཞན་འདུལ་བའི་སླད་དུ་སེམས་ཅན་གྱི་ཁམས་ཇི་ཙམ་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཇི་ཙམ་པ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཁམས་སུ་གདགས་པས་བཏགས་པ་ཇི་ཙམ་པ་དེ་སྲིད་ཀྱི་དུས་སུ་སེམས་ཅན་འདུལ་ཡང་ཡོངས་སུ་མི་སྐྱོའོ། །
en: The venerable Upāli next addressed the Blessed One: “Blessed One, bodhisattvas who have tamed themselves will, for the sake of taming other beings, not grow weary of taming beings for as long as there is still a realm of beings, an expanse of phenomena, and conceptual designations made though the imputations of desire, anger, and dullness.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་དུལ་བ་ཡིན་ན། དེ་དག་སེམས་ཅན་རྣམས་ཀྱི་ཁོང་དུ་མི་ཆུད་དོ་སྙམ་མོ། །
en: A bodhisattva thinks, ‘All phenomena are well tamed, but this is not something beings understand.’

source: ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་ཀྱིས་དུལ་བ་སྟེ། དེ་ལ་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་དང་། བརྩོན་པ་ཐམས་ཅད་མི་སྤྱོད་དོ། །
en: All phenomena are tamed through emptiness; they are not involved with adopted views or any kind of effort.

source: ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མ་མཆིས་པས་དུལ་བ་སྟེ། དེ་ལ་རྣམ་པར་རྟོག་པ་དང་དཔྱོད་པ་མི་སྤྱོད་དོ། །
en: All phenomena are tamed through signlessness; they are not involved with concepts or actions.
